/*
打印n行杨辉三角

任务描述
本关任务：实验课本P85  程序设计第（5）题
编写一个能打印n行杨辉三角的小程序。

编程要求
根据提示，在右侧编辑器补充代码，使之能打印n行(1≤n≤10)杨辉三角。

测试说明
平台会对你编写的代码进行测试：

测试输入：9；
预期输出：
                  1
                1   1
              1   2   1
            1   3   3   1
          1   4   6   4   1
        1   5   10  10  5   1
      1   6   15  20  15  6   1
    1   7   21  35  35  21  7   1
  1   8   28  56  70  56  28  8   1
1   9   36  84  126 126 84  36  9   1
                  1
                1   1
              1   2   1
            1   3   3   1
          1   4   6   4   1
        1   5   10  10  5   1
      1   6   15  20  15  6   1
    1   7   21  35  35  21  7   1
  1   8   28  56  70  56  28  8   1
1   9   36  84  126 126 84  36  9   1
                    1
                  1   1
                1   2   1
              1   3   3   1
            1   4   6   4   1
          1   5   10  10  5   1
        1   6   15  20  15  6   1
      1   7   21  35  35  21  7   1
    1   8   28  56  70  56  28  8   1
  1   9   36  84  126 126 84  36  9   1
1   10  45  120 210 252 210 120 45  10  1

提示：
参考实验课本85-86页的公式和格式

补充：
最后一行左边不能有空格
*/

/*
                          _ooOoo_
                         o8888888o
                         88" . "88
                         (| -_- |)
                         O\  =  /O
                      ____/`---'\____
                    .'  \\|     |//  `.
                   /  \\|||  :  |||//  \
                  /  _||||| -:- |||||-  \
                  |   | \\\  -  /// |   |
                  | \_|  ''\---/''  |   |
                  \  .-\__  `-`  ___/-. /
                ___`. .'  /--.--\  `. . __
             ."" '<  `.___\_<|>_/___.'  >'"".
            | | :  `- \`.;`\ _ /`;.`/ - ` : | |
            \  \ `-.   \_ __\ /__ _/   .-` /  /
       ======`-.____`-.___\_____/___.-`____.-'======
                          `=---='
       ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
                佛祖保佑       永无BUG
       */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
int main()
{
    int n;
    scanf("%d", &n);

    int *table = malloc((n + 2) * sizeof(int));
    int *table_tmp = malloc((n + 2) * sizeof(int));
    for (int i = 0; i < n + 2; i++)
    {
        table[i] = 0;
    }
    memcpy(table_tmp, table, (n + 2) * sizeof(int));

    int max_length = n * 4 - 3;
    int space_1st_line = max_length / 2 + 2;
    for (int i = 0; i <= n; i++)
    {
        for (int j = 0; j < space_1st_line - i * 2; j++)
        {
            putchar(' ');
        }

        table[i] = 1;
        table_tmp[i] = 1;
        for (int j = 1; j < i; j++)
        {
            table_tmp[j] += table[j - 1];
        }
        for (int j = 0; j < i + 1; j++)
        {
            printf("%-4d", table_tmp[j]);
        }
        putchar('\n');

        memcpy(table, table_tmp, (n + 2) * sizeof(int));
    }
}