/*
第4关：单精度浮点数读写
任务描述
本关任务：参考实验指导书P226,3.(2)。从键盘输入10个单精度浮点数，以二进制形式存入文件float.dat中（将此功能定义成函数）。再从文件中读出这10个单精度浮点数,把每个单精度浮点数，按每个字节的二进制形式显示在屏幕上（将此功能定义成函数）。

根据提示，在右侧编辑器补充代码。

测试说明
平台会对你编写的代码进行测试：

测试输入：1.25，2.25，3.75，4.465，101.25，102.75，30.68，42.85，58.65，102.25；
预期输出：
00111111101000000000000000000000
01000000000100000000000000000000
01000000011100000000000000000000
01000000100011101110000101001000
01000010110010101000000000000000
01000010110011011000000000000000
01000001111101010111000010100100
01000010001010110110011001100110
01000010011010101001100110011010
01000010110011001000000000000000


测试输入：
-0.58 -1.25 -2.25 -3.76 -4.42 -100.25 -58.65 -62.636 -112.65 -165.58
—— 预期输出 ——
—— 实际输出 ——

10111111000101000111101011100001
10111111101000000000000000000000
11000000000100000000000000000000
11000000011100001010001111010111
11000000100011010111000010100100
11000010110010001000000000000000
11000010011010101001100110011010
11000010011110101000101101000100
11000010111000010100110011001101
11000011001001011001010001111011
*/
#include <stdio.h>
#include <stdlib.h>

void Float_write(FILE *fp)
{
    for (int i = 0; i < 10; i++)
    {
        float f;
        scanf("%f", &f);
        fwrite(&f, sizeof(float), 1, fp);
        ;
    }
}

void Float_print(float f)
{

    int tmp = *(int *)(&f);
    for (int i = 0; i < 8 * sizeof(float); i++)
    {
        printf("%d", (tmp >> (31 - i)) & 1);
    }

    printf("\n");
}

void Float_read(FILE *fp)
{
    for (int i = 0; i < 10; i++)
    {
        float f;
        fread(&f, sizeof(float), 1, fp);
        ;
        Float_print(f);
    }
}

int main(int argc, char const *argv[])
{
    FILE *fp = fopen("float.dat", "wb");
    Float_write(fp);
    fclose(fp);

    fp = fopen("float.dat", "rb");
    Float_read(fp);
    fclose(fp);

    return 0;
}
